GopalSaraf/Practicals/PSDL/include/proc/pic16lf15375.inc
// Register: LATC
#define LATC LATC
LATC                                     equ 001Ah
// bitfield definitions
LATC_LATC0_POSN                          equ 0000h
LATC_LATC0_POSITION                      equ 0000h
LATC_LATC0_SIZE                          equ 0001h
LATC_LATC0_LENGTH                        equ 0001h
LATC_LATC0_MASK                          equ 0001h
LATC_LATC1_POSN                          equ 0001h
LATC_LATC1_POSITION                      equ 0001h
LATC_LATC1_SIZE                          equ 0001h
LATC_LATC1_LENGTH                        equ 0001h
LATC_LATC1_MASK                          equ 0002h
LATC_LATC2_POSN                          equ 0002h
LATC_LATC2_POSITION                      equ 0002h
LATC_LATC2_SIZE                          equ 0001h
LATC_LATC2_LENGTH                        equ 0001h
LATC_LATC2_MASK                          equ 0004h
LATC_LATC3_POSN                          equ 0003h
LATC_LATC3_POSITION                      equ 0003h
LATC_LATC3_SIZE                          equ 0001h
LATC_LATC3_LENGTH                        equ 0001h
LATC_LATC3_MASK                          equ 0008h
LATC_LATC4_POSN                          equ 0004h
LATC_LATC4_POSITION                      equ 0004h
LATC_LATC4_SIZE                          equ 0001h
LATC_LATC4_LENGTH                        equ 0001h
LATC_LATC4_MASK                          equ 0010h
LATC_LATC5_POSN                          equ 0005h
LATC_LATC5_POSITION                      equ 0005h
LATC_LATC5_SIZE                          equ 0001h
LATC_LATC5_LENGTH                        equ 0001h
LATC_LATC5_MASK                          equ 0020h
LATC_LATC6_POSN                          equ 0006h
LATC_LATC6_POSITION                      equ 0006h
LATC_LATC6_SIZE                          equ 0001h
LATC_LATC6_LENGTH                        equ 0001h
LATC_LATC6_MASK                          equ 0040h
LATC_LATC7_POSN                          equ 0007h
LATC_LATC7_POSITION                      equ 0007h
LATC_LATC7_SIZE                          equ 0001h
LATC_LATC7_LENGTH                        equ 0001h
LATC_LATC7_MASK                          equ 0080h

// Register: LATD
#define LATD LATD
LATD                                     equ 001Bh
// bitfield definitions
LATD_LATD0_POSN                          equ 0000h
LATD_LATD0_POSITION                      equ 0000h
LATD_LATD0_SIZE                          equ 0001h
LATD_LATD0_LENGTH                        equ 0001h
LATD_LATD0_MASK                          equ 0001h
LATD_LATD1_POSN                          equ 0001h
LATD_LATD1_POSITION                      equ 0001h
LATD_LATD1_SIZE                          equ 0001h
LATD_LATD1_LENGTH                        equ 0001h
LATD_LATD1_MASK                          equ 0002h
LATD_LATD2_POSN                          equ 0002h
LATD_LATD2_POSITION                      equ 0002h
LATD_LATD2_SIZE                          equ 0001h
LATD_LATD2_LENGTH                        equ 0001h
LATD_LATD2_MASK                          equ 0004h
LATD_LATD3_POSN                          equ 0003h
LATD_LATD3_POSITION                      equ 0003h
LATD_LATD3_SIZE                          equ 0001h
LATD_LATD3_LENGTH                        equ 0001h
LATD_LATD3_MASK                          equ 0008h
LATD_LATD4_POSN                          equ 0004h
LATD_LATD4_POSITION                      equ 0004h
LATD_LATD4_SIZE                          equ 0001h
LATD_LATD4_LENGTH                        equ 0001h
LATD_LATD4_MASK                          equ 0010h
LATD_LATD5_POSN                          equ 0005h
LATD_LATD5_POSITION                      equ 0005h
LATD_LATD5_SIZE                          equ 0001h
LATD_LATD5_LENGTH                        equ 0001h
LATD_LATD5_MASK                          equ 0020h
LATD_LATD6_POSN                          equ 0006h
LATD_LATD6_POSITION                      equ 0006h
LATD_LATD6_SIZE                          equ 0001h
LATD_LATD6_LENGTH                        equ 0001h
LATD_LATD6_MASK                          equ 0040h
LATD_LATD7_POSN                          equ 0007h
LATD_LATD7_POSITION                      equ 0007h
LATD_LATD7_SIZE                          equ 0001h
LATD_LATD7_LENGTH                        equ 0001h
LATD_LATD7_MASK                          equ 0080h

// Register: LATE
#define LATE LATE
LATE                                     equ 001Ch
// bitfield definitions
LATE_LATE0_POSN                          equ 0000h
LATE_LATE0_POSITION                      equ 0000h
LATE_LATE0_SIZE                          equ 0001h
LATE_LATE0_LENGTH                        equ 0001h
LATE_LATE0_MASK                          equ 0001h
LATE_LATE1_POSN                          equ 0001h
LATE_LATE1_POSITION                      equ 0001h
LATE_LATE1_SIZE                          equ 0001h
LATE_LATE1_LENGTH                        equ 0001h
LATE_LATE1_MASK                          equ 0002h
LATE_LATE2_POSN                          equ 0002h
LATE_LATE2_POSITION                      equ 0002h
LATE_LATE2_SIZE                          equ 0001h
LATE_LATE2_LENGTH                        equ 0001h
LATE_LATE2_MASK                          equ 0004h

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 009Bh
// bitfield definitions
ADRESL_ADRESL_POSN                       equ 0000h
ADRESL_ADRESL_POSITION                   equ 0000h
ADRESL_ADRESL_SIZE                       equ 0008h
ADRESL_ADRESL_LENGTH                     equ 0008h
ADRESL_ADRESL_MASK                       equ 00FFh
ADRESL_ADRESL0_POSN                      equ 0000h
ADRESL_ADRESL0_POSITION                  equ 0000h
ADRESL_ADRESL0_SIZE                      equ 0001h
ADRESL_ADRESL0_LENGTH                    equ 0001h
ADRESL_ADRESL0_MASK                      equ 0001h
ADRESL_ADRESL1_POSN                      equ 0001h
ADRESL_ADRESL1_POSITION                  equ 0001h
ADRESL_ADRESL1_SIZE                      equ 0001h
ADRESL_ADRESL1_LENGTH                    equ 0001h
ADRESL_ADRESL1_MASK                      equ 0002h
ADRESL_ADRESL2_POSN                      equ 0002h
ADRESL_ADRESL2_POSITION                  equ 0002h
ADRESL_ADRESL2_SIZE                      equ 0001h
ADRESL_ADRESL2_LENGTH                    equ 0001h
ADRESL_ADRESL2_MASK                      equ 0004h
ADRESL_ADRESL3_POSN                      equ 0003h
ADRESL_ADRESL3_POSITION                  equ 0003h
ADRESL_ADRESL3_SIZE                      equ 0001h
ADRESL_ADRESL3_LENGTH                    equ 0001h
ADRESL_ADRESL3_MASK                      equ 0008h
ADRESL_ADRESL4_POSN                      equ 0004h
ADRESL_ADRESL4_POSITION                  equ 0004h
ADRESL_ADRESL4_SIZE                      equ 0001h
ADRESL_ADRESL4_LENGTH                    equ 0001h
ADRESL_ADRESL4_MASK                      equ 0010h
ADRESL_ADRESL5_POSN                      equ 0005h
ADRESL_ADRESL5_POSITION                  equ 0005h
ADRESL_ADRESL5_SIZE                      equ 0001h
ADRESL_ADRESL5_LENGTH                    equ 0001h
ADRESL_ADRESL5_MASK                      equ 0020h
ADRESL_ADRESL6_POSN                      equ 0006h
ADRESL_ADRESL6_POSITION                  equ 0006h
ADRESL_ADRESL6_SIZE                      equ 0001h
ADRESL_ADRESL6_LENGTH                    equ 0001h
ADRESL_ADRESL6_MASK                      equ 0040h
ADRESL_ADRESL7_POSN                      equ 0007h
ADRESL_ADRESL7_POSITION                  equ 0007h
ADRESL_ADRESL7_SIZE                      equ 0001h
ADRESL_ADRESL7_LENGTH                    equ 0001h
ADRESL_ADRESL7_MASK                      equ 0080h

// Register: ADRESH
#define ADRESH ADRESH
ADRESH                                   equ 009Ch
// bitfield definitions
ADRESH_ADRESH_POSN                       equ 0000h
ADRESH_ADRESH_POSITION                   equ 0000h
ADRESH_ADRESH_SIZE                       equ 0008h
ADRESH_ADRESH_LENGTH                     equ 0008h
ADRESH_ADRESH_MASK                       equ 00FFh
ADRESH_ADRESH0_POSN                      equ 0000h
ADRESH_ADRESH0_POSITION                  equ 0000h
ADRESH_ADRESH0_SIZE                      equ 0001h
ADRESH_ADRESH0_LENGTH                    equ 0001h
ADRESH_ADRESH0_MASK                      equ 0001h
ADRESH_ADRESH1_POSN                      equ 0001h
ADRESH_ADRESH1_POSITION                  equ 0001h
ADRESH_ADRESH1_SIZE                      equ 0001h
ADRESH_ADRESH1_LENGTH                    equ 0001h
ADRESH_ADRESH1_MASK                      equ 0002h
ADRESH_ADRESH2_POSN                      equ 0002h
ADRESH_ADRESH2_POSITION                  equ 0002h
ADRESH_ADRESH2_SIZE                      equ 0001h
ADRESH_ADRESH2_LENGTH                    equ 0001h
ADRESH_ADRESH2_MASK                      equ 0004h
ADRESH_ADRESH3_POSN                      equ 0003h
ADRESH_ADRESH3_POSITION                  equ 0003h
ADRESH_ADRESH3_SIZE                      equ 0001h
ADRESH_ADRESH3_LENGTH                    equ 0001h
ADRESH_ADRESH3_MASK                      equ 0008h
ADRESH_ADRESH4_POSN                      equ 0004h
ADRESH_ADRESH4_POSITION                  equ 0004h
ADRESH_ADRESH4_SIZE                      equ 0001h
ADRESH_ADRESH4_LENGTH                    equ 0001h
ADRESH_ADRESH4_MASK                      equ 0010h
ADRESH_ADRESH5_POSN                      equ 0005h
ADRESH_ADRESH5_POSITION                  equ 0005h
ADRESH_ADRESH5_SIZE                      equ 0001h
ADRESH_ADRESH5_LENGTH                    equ 0001h
ADRESH_ADRESH5_MASK                      equ 0020h
ADRESH_ADRESH6_POSN                      equ 0006h
ADRESH_ADRESH6_POSITION                  equ 0006h
ADRESH_ADRESH6_SIZE                      equ 0001h
ADRESH_ADRESH6_LENGTH                    equ 0001h
ADRESH_ADRESH6_MASK                      equ 0040h
ADRESH_ADRESH7_POSN                      equ 0007h
ADRESH_ADRESH7_POSITION                  equ 0007h
ADRESH_ADRESH7_SIZE                      equ 0001h
ADRESH_ADRESH7_LENGTH                    equ 0001h
ADRESH_ADRESH7_MASK                      equ 0080h

// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 009Dh
// bitfield definitions
ADCON0_ADON_POSN                         equ 0000h
ADCON0_ADON_POSITION                     equ 0000h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0001h
ADCON0_GOnDONE_POSN                      equ 0001h
ADCON0_GOnDONE_POSITION                  equ 0001h
ADCON0_GOnDONE_SIZE                      equ 0001h
ADCON0_GOnDONE_LENGTH                    equ 0001h
ADCON0_GOnDONE_MASK                      equ 0002h
ADCON0_CHS0_POSN                         equ 0002h
ADCON0_CHS0_POSITION                     equ 0002h
ADCON0_CHS0_SIZE                         equ 0001h
ADCON0_CHS0_LENGTH                       equ 0001h
ADCON0_CHS0_MASK                         equ 0004h
ADCON0_CHS1_POSN                         equ 0003h
ADCON0_CHS1_POSITION                     equ 0003h
ADCON0_CHS1_SIZE                         equ 0001h
ADCON0_CHS1_LENGTH                       equ 0001h
ADCON0_CHS1_MASK                         equ 0008h
ADCON0_CHS2_POSN                         equ 0004h
ADCON0_CHS2_POSITION                     equ 0004h
ADCON0_CHS2_SIZE                         equ 0001h
ADCON0_CHS2_LENGTH                       equ 0001h
ADCON0_CHS2_MASK                         equ 0010h
ADCON0_CHS3_POSN                         equ 0005h
ADCON0_CHS3_POSITION                     equ 0005h
ADCON0_CHS3_SIZE                         equ 0001h
ADCON0_CHS3_LENGTH                       equ 0001h
ADCON0_CHS3_MASK                         equ 0020h
ADCON0_CHS4_POSN                         equ 0006h
ADCON0_CHS4_POSITION                     equ 0006h
ADCON0_CHS4_SIZE                         equ 0001h
ADCON0_CHS4_LENGTH                       equ 0001h
ADCON0_CHS4_MASK                         equ 0040h
ADCON0_CHS5_POSN                         equ 0007h
ADCON0_CHS5_POSITION                     equ 0007h
ADCON0_CHS5_SIZE                         equ 0001h
ADCON0_CHS5_LENGTH                       equ 0001h
ADCON0_CHS5_MASK                         equ 0080h
ADCON0_GO_POSN                           equ 0001h
ADCON0_GO_POSITION                       equ 0001h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0002h
ADCON0_CHS_POSN                          equ 0002h
ADCON0_CHS_POSITION                      equ 0002h
ADCON0_CHS_SIZE                          equ 0006h
ADCON0_CHS_LENGTH                        equ 0006h
ADCON0_CHS_MASK                          equ 00FCh

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 009Eh
// bitfield definitions
ADCON1_ADPREF0_POSN                      equ 0000h
ADCON1_ADPREF0_POSITION                  equ 0000h
ADCON1_ADPREF0_SIZE                      equ 0001h
ADCON1_ADPREF0_LENGTH                    equ 0001h
ADCON1_ADPREF0_MASK                      equ 0001h
ADCON1_ADPREF1_POSN                      equ 0001h
ADCON1_ADPREF1_POSITION                  equ 0001h
ADCON1_ADPREF1_SIZE                      equ 0001h
ADCON1_ADPREF1_LENGTH                    equ 0001h
ADCON1_ADPREF1_MASK                      equ 0002h
ADCON1_ADCS0_POSN                        equ 0004h
ADCON1_ADCS0_POSITION                    equ 0004h
ADCON1_ADCS0_SIZE                        equ 0001h
ADCON1_ADCS0_LENGTH                      equ 0001h
ADCON1_ADCS0_MASK                        equ 0010h
ADCON1_ADCS1_POSN                        equ 0005h
ADCON1_ADCS1_POSITION                    equ 0005h
ADCON1_ADCS1_SIZE                        equ 0001h
ADCON1_ADCS1_LENGTH                      equ 0001h
ADCON1_ADCS1_MASK                        equ 0020h
ADCON1_ADCS2_POSN                        equ 0006h
ADCON1_ADCS2_POSITION                    equ 0006h
ADCON1_ADCS2_SIZE                        equ 0001h
ADCON1_ADCS2_LENGTH                      equ 0001h
ADCON1_ADCS2_MASK                        equ 0040h
ADCON1_ADFM_POSN                         equ 0007h
ADCON1_ADFM_POSITION                     equ 0007h
ADCON1_ADFM_SIZE                         equ 0001h
ADCON1_ADFM_LENGTH                       equ 0001h
ADCON1_ADFM_MASK                         equ 0080h
ADCON1_ADPREF_POSN                       equ 0000h
ADCON1_ADPREF_POSITION                   equ 0000h
ADCON1_ADPREF_SIZE                       equ 0002h
ADCON1_ADPREF_LENGTH                     equ 0002h
ADCON1_ADPREF_MASK                       equ 0003h
ADCON1_ADCS_POSN                         equ 0004h
ADCON1_ADCS_POSITION                     equ 0004h
ADCON1_ADCS_SIZE                         equ 0003h
ADCON1_ADCS_LENGTH                       equ 0003h
ADCON1_ADCS_MASK                         equ 0070h

